OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1458.h
#define C                       STATUSbits.C                    // bit 0
#define DC                      STATUSbits.DC                   // bit 1
#define Z                       STATUSbits.Z                    // bit 2
#define NOT_PD                  STATUSbits.NOT_PD               // bit 3
#define NOT_TO                  STATUSbits.NOT_TO               // bit 4

#define TMR1ON                  T1CONbits.TMR1ON                // bit 0
#define NOT_T1SYNC              T1CONbits.NOT_T1SYNC            // bit 2
#define T1OSCEN                 T1CONbits.T1OSCEN               // bit 3
#define T1CKPS0                 T1CONbits.T1CKPS0               // bit 4
#define T1CKPS1                 T1CONbits.T1CKPS1               // bit 5
#define TMR1CS0                 T1CONbits.TMR1CS0               // bit 6
#define TMR1CS1                 T1CONbits.TMR1CS1               // bit 7

#define T1GSS0                  T1GCONbits.T1GSS0               // bit 0
#define T1GSS1                  T1GCONbits.T1GSS1               // bit 1
#define T1GVAL                  T1GCONbits.T1GVAL               // bit 2
#define T1GGO_NOT_DONE          T1GCONbits.T1GGO_NOT_DONE       // bit 3
#define T1GSPM                  T1GCONbits.T1GSPM               // bit 4
#define T1GTM                   T1GCONbits.T1GTM                // bit 5
#define T1GPOL                  T1GCONbits.T1GPOL               // bit 6
#define TMR1GE                  T1GCONbits.TMR1GE               // bit 7

#define T2CKPS0                 T2CONbits.T2CKPS0               // bit 0
#define T2CKPS1                 T2CONbits.T2CKPS1               // bit 1
#define TMR2ON                  T2CONbits.TMR2ON                // bit 2
#define TOUTPS0                 T2CONbits.TOUTPS0               // bit 3
#define TOUTPS1                 T2CONbits.TOUTPS1               // bit 4
#define TOUTPS2                 T2CONbits.TOUTPS2               // bit 5
#define TOUTPS3                 T2CONbits.TOUTPS3               // bit 6

#define TRISA4                  TRISAbits.TRISA4                // bit 4
#define TRISA5                  TRISAbits.TRISA5                // bit 5

#define TRISB4                  TRISBbits.TRISB4                // bit 4
#define TRISB5                  TRISBbits.TRISB5                // bit 5
#define TRISB6                  TRISBbits.TRISB6                // bit 6
#define TRISB7                  TRISBbits.TRISB7                // bit 7

#define TRISC0                  TRISCbits.TRISC0                // bit 0
#define TRISC1                  TRISCbits.TRISC1                // bit 1
#define TRISC2                  TRISCbits.TRISC2                // bit 2
#define TRISC3                  TRISCbits.TRISC3                // bit 3
#define TRISC4                  TRISCbits.TRISC4                // bit 4
#define TRISC5                  TRISCbits.TRISC5                // bit 5
#define TRISC6                  TRISCbits.TRISC6                // bit 6
#define TRISC7                  TRISCbits.TRISC7                // bit 7

#define TX9D                    TXSTAbits.TX9D                  // bit 0
#define TRMT                    TXSTAbits.TRMT                  // bit 1
#define BRGH                    TXSTAbits.BRGH                  // bit 2
#define SENDB                   TXSTAbits.SENDB                 // bit 3
#define SYNC                    TXSTAbits.SYNC                  // bit 4
#define TXEN                    TXSTAbits.TXEN                  // bit 5
#define TX9                     TXSTAbits.TX9                   // bit 6
#define CSRC                    TXSTAbits.CSRC                  // bit 7

#define ADDR0                   UADDRbits.ADDR0                 // bit 0
#define ADDR1                   UADDRbits.ADDR1                 // bit 1
#define ADDR2                   UADDRbits.ADDR2                 // bit 2
#define ADDR3                   UADDRbits.ADDR3                 // bit 3
#define ADDR4                   UADDRbits.ADDR4                 // bit 4
#define ADDR5                   UADDRbits.ADDR5                 // bit 5
#define ADDR6                   UADDRbits.ADDR6                 // bit 6

#define PPB0                    UCFGbits.PPB0                   // bit 0
#define PPB1                    UCFGbits.PPB1                   // bit 1
#define FSEN                    UCFGbits.FSEN                   // bit 2
#define UPUEN                   UCFGbits.UPUEN                  // bit 4
#define UTEYE                   UCFGbits.UTEYE                  // bit 7

#define SUSPND                  UCONbits.SUSPND                 // bit 1
#define RESUME                  UCONbits.RESUME                 // bit 2
#define USBEN                   UCONbits.USBEN                  // bit 3
#define PKTDIS                  UCONbits.PKTDIS                 // bit 4
#define SE0                     UCONbits.SE0                    // bit 5
#define PPBRST                  UCONbits.PPBRST                 // bit 6

#define PIDEE                   UEIEbits.PIDEE                  // bit 0
#define CRC5EE                  UEIEbits.CRC5EE                 // bit 1
#define CRC16EE                 UEIEbits.CRC16EE                // bit 2
#define DFN8EE                  UEIEbits.DFN8EE                 // bit 3
#define BTOEE                   UEIEbits.BTOEE                  // bit 4
#define BTSEE                   UEIEbits.BTSEE                  // bit 7

#define PIDEF                   UEIRbits.PIDEF                  // bit 0
#define CRC5EF                  UEIRbits.CRC5EF                 // bit 1
#define CRC16EF                 UEIRbits.CRC16EF                // bit 2
#define DFN8EF                  UEIRbits.DFN8EF                 // bit 3
#define BTOEF                   UEIRbits.BTOEF                  // bit 4
#define BTSEF                   UEIRbits.BTSEF                  // bit 7

#define EPSTALL                 UEP0bits.EPSTALL                // bit 0
#define EPINEN                  UEP0bits.EPINEN                 // bit 1
#define EPOUTEN                 UEP0bits.EPOUTEN                // bit 2
#define EPCONDIS                UEP0bits.EPCONDIS               // bit 3
#define EPHSHK                  UEP0bits.EPHSHK                 // bit 4

