OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1458.h
#define FRM8                    UFRMHbits.FRM8                  // bit 0
#define FRM9                    UFRMHbits.FRM9                  // bit 1
#define FRM10                   UFRMHbits.FRM10                 // bit 2

#define FRM0                    UFRMLbits.FRM0                  // bit 0
#define FRM1                    UFRMLbits.FRM1                  // bit 1
#define FRM2                    UFRMLbits.FRM2                  // bit 2
#define FRM3                    UFRMLbits.FRM3                  // bit 3
#define FRM4                    UFRMLbits.FRM4                  // bit 4
#define FRM5                    UFRMLbits.FRM5                  // bit 5
#define FRM6                    UFRMLbits.FRM6                  // bit 6
#define FRM7                    UFRMLbits.FRM7                  // bit 7

#define URSTIE                  UIEbits.URSTIE                  // bit 0
#define UERRIE                  UIEbits.UERRIE                  // bit 1
#define ACTVIE                  UIEbits.ACTVIE                  // bit 2
#define TRNIE                   UIEbits.TRNIE                   // bit 3
#define IDLEIE                  UIEbits.IDLEIE                  // bit 4
#define STALLIE                 UIEbits.STALLIE                 // bit 5
#define SOFIE                   UIEbits.SOFIE                   // bit 6

#define URSTIF                  UIRbits.URSTIF                  // bit 0
#define UERRIF                  UIRbits.UERRIF                  // bit 1
#define ACTVIF                  UIRbits.ACTVIF                  // bit 2
#define TRNIF                   UIRbits.TRNIF                   // bit 3
#define IDLEIF                  UIRbits.IDLEIF                  // bit 4
#define STALLIF                 UIRbits.STALLIF                 // bit 5
#define SOFIF                   UIRbits.SOFIF                   // bit 6

#define PPBI                    USTATbits.PPBI                  // bit 1
#define DIR                     USTATbits.DIR                   // bit 2
#define ENDP0                   USTATbits.ENDP0                 // bit 3
#define ENDP1                   USTATbits.ENDP1                 // bit 4
#define ENDP2                   USTATbits.ENDP2                 // bit 5
#define ENDP3                   USTATbits.ENDP3                 // bit 6

#define VREGPM0                 VREGCONbits.VREGPM0             // bit 0
#define VREGPM1                 VREGCONbits.VREGPM1             // bit 1

#define SWDTEN                  WDTCONbits.SWDTEN               // bit 0
#define WDTPS0                  WDTCONbits.WDTPS0               // bit 1
#define WDTPS1                  WDTCONbits.WDTPS1               // bit 2
#define WDTPS2                  WDTCONbits.WDTPS2               // bit 3
#define WDTPS3                  WDTCONbits.WDTPS3               // bit 4
#define WDTPS4                  WDTCONbits.WDTPS4               // bit 5

#define WPUA3                   WPUAbits.WPUA3                  // bit 3
#define WPUA4                   WPUAbits.WPUA4                  // bit 4
#define WPUA5                   WPUAbits.WPUA5                  // bit 5

#define WPUB4                   WPUBbits.WPUB4                  // bit 4
#define WPUB5                   WPUBbits.WPUB5                  // bit 5
#define WPUB6                   WPUBbits.WPUB6                  // bit 6
#define WPUB7                   WPUBbits.WPUB7                  // bit 7

#endif // #ifndef NO_BIT_DEFINES

#endif // #ifndef __PIC16F1458_H__
